Repository: Telefonica/latch-plugin-wordpress
Catalog: languages/latch-*.po
Languages: ca

source: Global settings
ca: Paràmetres globals

source: API URL
ca: URL de l'API

source: Latch settings
ca: Paràmetres de Latch

source: Fill in the data received when you registered the application in Latch:
ca: Omple les dades rebudes quan vas registrar l'aplicació amb Latch:

source: Save Changes
ca: Desar canvis

source: Invalid application ID
ca: Application ID no vàlid

source: Invalid secret key
ca: Secret key no vàlida

source: Latch Setup
ca: Configuració de Latch

source: Latch token
ca: Token de Latch

source: Your account is protected with Latch
ca: El teu compte està protegit amb Latch

source: Stop using Latch
ca: Deixar d'utilizar Latch

source: <strong>ERROR</strong>: Invalid token
ca: <strong>ERROR</strong>: Token no vàlid

source: <strong>ERROR</strong>: Invalid username or incorrect password.
ca: <strong>ERROR</strong>: Nom d'usuari o paraula de pas no vàlid.

source: Powered by WordPress
ca: Funciona amb WordPress

source: Log In
ca: Accedir
