Repository: Telefonica/latch-plugin-wordpress
Catalog: latch/languages/latch-*.po
Languages: es_es

source: Global settings
es_es: Ajustes globales

source: Application ID
es_es: ID de aplicación

source: Secret key
es_es: Secreto

source: Latch settings
es_es: Ajustes Latch

source: Fill in the data received when you registered the application in Latch:
es_es: Introduzca los datos generados al registrar la aplicación en Latch:

source: Save Changes
es_es: Guardar cambios

source: Invalid application ID
es_es: ID de aplicación no válido

source: Invalid secret key
es_es: Secreto no válido

source: Latch Setup
es_es: Configuración de Latch

source: Latch token
es_es: Token de Latch

source: Your account is protected with Latch
es_es: Su cuenta está protegida con Latch

source: Stop using Latch
es_es: Dejar de usar Latch

source: <strong>ERROR</strong>: Invalid token
es_es: <strong>ERROR</strong>: Token no válido

source: <strong>ERROR</strong>: Invalid username or incorrect password.
es_es: <strong>ERROR</strong>: Usuario no válido o contraseña incorrecta.
